---
kind: other
id: Methods.T:Autodesk.Revit.DB.Electrical.CableTrayType
source: html/1ad3d03e-72d4-826c-5cc3-a8f8a3734528.htm
---
# CableTrayType Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.